In [9]:
import pandas as pd
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)
display(df)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [11]:
df.fillna(value=df.mean())

   student1  student2  student3
0      90.0      77.0        88
1      84.0      77.0        65
2      87.0      77.0        93

In [12]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
display(df)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
df.drop(df.columns[(df>=10).apply(lambda col: sum(col)>0)], axis=1)

   A  B
0  0  1
1  4  5
2  8  9

In [20]:
import pandas as pd
my_dict = {'Exam': [90, 84, 89], 'Exam2': [77, 49, 88], 'Exam3': [88, 65, 93]}
df = pd.DataFrame(my_dict, index=['Student1', 'Student2', 'Student3'])
display(df)

          Exam  Exam2  Exam3
Student1    90     77     88
Student2    84     49     65
Student3    89     88     93

In [30]:
df.append(pd.Series(df.mean(numeric_only=True), name='Total'))

               Exam      Exam2  Exam3
Student1  90.000000  77.000000   88.0
Student2  84.000000  49.000000   65.0
Student3  89.000000  88.000000   93.0
Total     87.666667  71.333333   82.0